bench_result/value-128_mem-4194304.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=128 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=4194304 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-128_mem-4194304.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     128 bytes each (64 bytes after compression)
Entries:    1000000
RawSize:    137.3 MB (estimated)
FileSize:   76.3 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 8.5484 GB
fillrandom   :       1.945 micros/op;   70.6 MB/s 1.95 s

write in SSD size (MB):51.7585
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        8         0        0       202
  1        2       16         0        0        15
  2        4       64         0        0        13

readrandom   :       1.867 micros/op;   73.6 MB/s (1000000 of 1000000 found) 1.87 s

write in SSD size (MB):69.0166
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2        8         0        0       202
  1        2       16         0        0        15
  2        2       32         0        0        13

pmem allocs 686634
Final Use NVM: 0.0546899 GB
Remainder of NVM space : 8.36853 GB