bench_result/value-16384_mem-67108864.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=16384 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=67108864 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-16384_mem-67108864.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     16384 bytes each (8192 bytes after compression)
Entries:    1000000
RawSize:    15640.3 MB (estimated)
FileSize:   7827.8 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 1.71799e+10 GB
fillrandom   :      13.118 micros/op; 1192.3 MB/s 13.12 s

write in SSD size (MB):3368.65
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2      128         5        0     15636
  1        1      128         0        0        15
  2       36     9217         0        0        15

readrandom   :       4.705 micros/op; 3324.0 MB/s (1000000 of 1000000 found) 4.71 s

write in SSD size (MB):4631.69
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       64         5        0     15700
  1        2      256         0        0        15
  2       27     6913         0        0        15

pmem allocs 556115
Final Use NVM: 7.06354 GB
Remainder of NVM space : 1.71799e+10 GB