bench_result/value-16384_mem-8388608.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=16384 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=8388608 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-16384_mem-8388608.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     16384 bytes each (8192 bytes after compression)
Entries:    1000000
RawSize:    15640.3 MB (estimated)
FileSize:   7827.8 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 1.36796 GB
fillrandom   :       9.931 micros/op; 1574.8 MB/s 9.93 s

write in SSD size (MB):2579.78
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2       16         7        0     15700
  1        3       48         2        0        15
  2      342    10946         1        0        15

readrandom   :      11.677 micros/op; 1339.2 MB/s (999915 of 1000000 found) 11.68 s

write in SSD size (MB):5742.79
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        2       16         7        0     15700
  1        1       16         2        0        15
  2      164     5249         1        0        15

pmem allocs 687824
Final Use NVM: 5.15706 GB
Remainder of NVM space : 0.000106812 GB