bench_result/value-256_mem-16777216.out
/home/eros/workspace-lsm/Thanoskv2/build/db_bench --num=1000000 --value_size=256 --benchmarks=fillrandom,stats,readrandom,stats --write_buffer_size=16777216 >> /home/eros/workspace-lsm/Thanoskv2/bench_result/value-256_mem-16777216.out
Default db path: /mnt/pmemdir/-1000/dbbench
Creating NVM pool size of 4294967296
Keys:       16 bytes each
Values:     256 bytes each (128 bytes after compression)
Entries:    1000000
RawSize:    259.4 MB (estimated)
FileSize:   137.3 MB (estimated)
------------------------------------------------
Final Use NVM: 0 GB
Remainder of NVM space : 8.57778 GB
fillrandom   :       2.064 micros/op;  125.7 MB/s 2.06 s

write in SSD size (MB):32.4154
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        3       48         0        0       322
  1        2       64         0        0        13
  2        2      128         0        0        10

readrandom   :       1.952 micros/op;  131.3 MB/s (988473 of 1000000 found) 1.95 s

write in SSD size (MB):64.866
memtable stall time: 0 s
L0 stall time: 0  s
L0 slow stall time: 0  s

                               Compactions
Level  Files Size(MB) Time(sec) Read(MB) Write(MB)
--------------------------------------------------
  0        1       16         0        0       322
  1        1       32         0        0        14
  2        2      128         0        0        13

pmem allocs 392318
Final Use NVM: 0.171877 GB
Remainder of NVM space : 8.28083 GB